lib/2025-03-18/README.md
```mermaid
classDiagram

class Hero {
int maxHp$
int maxMp$
int minHp$
int minMp$
int _hp
int _mp
String name;
hp() int
mp() int
hp(value) void
mp(value) void
}

class Wizard {
heal(target) void
}

class GreatWizard {
int maxMp$
int _mp
superHeal(target) void
}

class Slime {
int ap$
String suffix
attack(target) void
}

class PoisonSlime {
int poisonCount;
attack(target) void
}

Hero <-- Wizard
Wizard <-- GreatWizard

Slime <-- PoisonSlime
```
